polybassa/WyLight/cc3200/wyLightFirmware/bootloader/main.c
	// Copy the files from temporary file to SRAM at FIRMWARE_ORIGIN
	while (bytesCopied < bytesReceived) {
		if ((bytesReceived - bytesCopied) > sizeof(buffer)) readsize = sizeof(buffer);
		else readsize = (bytesReceived - bytesCopied);

		memset(buffer, 0, sizeof(buffer));
		retVal = sl_FsRead(sfileHandle, bytesCopied, (unsigned char *) buffer, readsize);
		if (retVal < 0) {
			// Error close the file and delete the temporary file
			retVal = sl_FsClose(sfileHandle, 0, 0, 0);
			UART_PRINT("Error during reading the file\r\n");
			return -1;
		}
		memcpy((void *)(FIRMWARE_ORIGIN + bytesCopied), buffer, readsize);
		bytesCopied += readsize;
	}
	// Close the opened files
	retVal = sl_FsClose(sfileHandle, 0, 0, 0);
	return 0;
}

static void startFirmware(void) {

	// patch Interrupt Vector Table
	unsigned int *pVectorTableOffset;
	pVectorTableOffset = (unsigned int *)0xe000ed08;
	*pVectorTableOffset = FIRMWARE_ORIGIN;

	// call Firmware
	void (*firmware_origin_entry)(void);
	unsigned int resetVector = *((unsigned int *)(FIRMWARE_ORIGIN +4));
	firmware_origin_entry = (void (*)(void))(resetVector);

	firmware_origin_entry();
}

int main() {
	int retRes = 0;
	long lRetVal = -1;

	//
	// Board Initialization
	//
	BoardInit();

	//
	// Configure the pinmux settings for the peripherals exercised
	//
	PinMuxConfig();

	//
	// Configuring UART
	//
	InitTerm();

	//
	// Display banner
	//
	DisplayBanner(APP_NAME);

	UART_PRINT("\n\rStarted file download sample Application.");
	UART_PRINT("\n\r\n\r");

	InitializeAppVariables();

	//
	// Following function configure the device to default state by cleaning
	// the persistent settings stored in NVMEM (viz. connection profiles &
	// policies, power policy etc)
	//
	// Applications may choose to skip this step if the developer is sure
	// that the device is in its desired state at start of applicaton
	//
	// Note that all profiles and persistent settings that were done on the
	// device will be lost
	//
	lRetVal = ConfigureSimpleLinkToDefaultState();
	if (lRetVal < 0) {
		if (DEVICE_NOT_IN_STATION_MODE == lRetVal) {
			UART_PRINT("Failed to configure the device in its default state\n\r");
		}

		LOOP_FOREVER(__LINE__);
	}

	UART_PRINT("Device is configured in default state \n\r");

	//
	// Assumption is that the device is configured in station mode already
	// and it is in its default state
	//
	lRetVal = sl_Start(0, 0, 0);
	if (lRetVal < 0 || ROLE_STA != lRetVal) {
		UART_PRINT("Failed to start the device \n\r");
		LOOP_FOREVER(__LINE__);
	}

	UART_PRINT("Device started as STATION \n\r");

	// Connecting to WLAN AP - Set with static parameters defined at the top
	// After this call we will be connected and have IP address
	WlanConnect();

	UART_PRINT("Connected to the AP: %s\r\n", SSID_NAME);

	// Create a TCP connection to the Web Server
	g_iSockID = CreateConnection(GetServerIP());

	if (g_iSockID < 0) return -1;

	UART_PRINT("Connection to server created successfully\r\n");
	// Download the file, verify the file and replace the exiting file
	if (GetFileFromServer(g_iSockID, "firmware.bin", "/temp/firmware.bin") < 0) {
		retRes = sl_Close(g_iSockID);
		UART_PRINT("Error downloading file\r\n");
		return -1;
	}

	retRes = sl_Close(g_iSockID);
	if (0 > retRes) {
		UART_PRINT("Error during closing socket\r\n");
		return -1;
	}

	g_iSockID = CreateConnection(GetServerIP());

	if (g_iSockID < 0) return -1;

	UART_PRINT("Connection to server created successfully\r\n");
	if (GetFileFromServer(g_iSockID, "firmware.sha", "/temp/firmware.sha") < 0) {
		retRes = sl_Close(g_iSockID);
		UART_PRINT("Error downloading file\r\n");
		return -1;
	}

	retRes = sl_Close(g_iSockID);
	if (0 > retRes) {
		UART_PRINT("Error during closing socket\r\n");
		return -1;
	}

	retRes = VerifyFile("/temp/firmware.bin", "/temp/firmware.sha");
	if (retRes < 0) {
		UART_PRINT("Error verifying files\r\n");
	}
	/*retRes = ReplaceFile("/temp/firmware.bin", FILE_NAME);
	if (retRes < 0) {
		UART_PRINT("Error during replacing the file\r\n");
	}*/

	UART_PRINT("\nThank you\r\n");
	// Stop the CC3200 device

	LoadFirmware((unsigned char *)"/temp/firmware.bin");
	startFirmware();
	sl_Stop(0xFF);

	LOOP_FOREVER(__LINE__);

}

